Repository: jeppeter/lilo
Catalog: debian/po/*.po
Languages: cs, sv

source: LILO configuration
cs: Konfigurace zavaděče LILO
sv: LILO konfiguration

source: It seems to be your first LILO installation. It is absolutely necessary to run liloconfig(8) when you complete this process and execute /sbin/lilo after this.
cs: Zdá se, že to je první instalace LILA. Je nezbytné, abyste po skončení tohoto procesu a spustili liloconfig(8) a poté /sbin/lilo.
sv: Detta verkar vara din första installation av LILO. Det är absolut nödvändigt att köra liloconfig(8) när du är färdig med denna process och starta /sbin/lilo efter det.

source: LILO won't work if you don't do this.
cs: Pokud to neuděláte, LILO nebude fungovat.
sv: LILO kommer inte att fungera om du inte gör detta.

source: Do you want to add the large-memory option?
cs: Přidat volbu large-memory?
sv: Vill du använda alternativet "large-memory"?

source: Usually LILO loads the initrd file into the first 15MB of memory to avoid a BIOS limitation with older systems (earlier than 2001 and few systems until 2004).
cs: LILO obvykle zavádí initrd do prvních 15MB paměti, aby tak obešlo omezení BIOSu starších systémů (před rokem 2001 a s několika výjimkami do roku 2004).
sv: LILO läser vanligen initrd-filen till de första 15MB minne för att undvika en BIOS-begränsning på äldre system (tidigare än 2001 och några få system till 2004).

source: With newer kernels the combination of kernel and initrd may not fit into the first 15MB of memory. LILO will compute the needed size of memory and will automatically use the memory above 15MB, too, if there is enough physical memory.
cs: U novějších jader se však nemusí kombinace jádra a initrd vlézt do prvních 15MB paměti. LILO si spočítá velikost potřebné paměti a pokud existuje dostatek fyzické paměti, automaticky použije i paměť nad 15MB.
sv: Dock är det så att med nyare kärnor förekommer det att kombinationen kärna och initrd inte får plats i de första 15MB minne. LILO beräknar hur mycket minne som behövs automatiskt och använder om möjligt mer än de första 15MB.

source: If this machine has a recent BIOS without a 15MB limitation and you want to use memory above 15MB for all kernels, set the 'large-memory' option.
cs: Pokud počítač obsahuje aktuální BIOS bez omezení na 15MB a chcete u všech jader použít paměť nad 15MB, nastavte volbu „large-memory“.
sv: Om maskinen har en nyare BIOS utan en begränsning på 15MB och du vill använda minne över 15MB för alla kärnor ska flaggan "large-memory" aktiveras.

source: Do you want to run /sbin/lilo now?
cs: Chcete nyní spustit /sbin/lilo?
sv: Vill du köra /sbin/lilo nu?

source: It was detected that it's necessary to run /sbin/lilo in order to activate the new LILO configuration.
cs: Bylo zjištěno, že pro použití nové konfigurace LILA je nutné spustit /sbin/lilo.
sv: Det upptäcktes att det är nödvändigt att köra /sbin/lilo för att aktivera den nya LILO-konfigurationen.

source: WARNING: This procedure will write data in your MBR and may overwrite some data there. If you skip this step, you must run /sbin/lilo before rebooting your computer, or your system may not boot again.
cs: VAROVÁNÍ: Tento postup zapíše data do MBR a tím přepíše data tam umístěná. Pokud tento krok přeskočíte, musíte spustit /sbin/lilo ještě před restartem počítače, protože jinak by systém nemusel nastartovat.
sv: VARNING: Denna procedur kommer att skriva data till din MBR (Master Boot Record) och kan skriva över saker som finns där. Om du hoppar över detta steg måste du köra /sbin/lilo före du startar om din dator annars kanske ditt system inte att startar igen.

source: Do you want to convert boot and root options?
cs: Přidat volbu large-memory?
sv: Vill du använda alternativet "large-memory"?

source: Since kernel using the newer disk interface 'libata' you need the newer DiskID and/or UUID in your /etc/lilo.conf for the boot and root options. For the most modern systems you should use this conversion and then run '/sbin/lilo'.
cs: Na jádrech používajících novější diskové rozhraní „libata“, budete pro volby boot a root v /etc/lilo.conf potřebovat nové DiskID a/nebo UUID. Na většině moderních systémů byste měli tento převod povolit a potom spustit „/sbin/lilo“.
sv: Tills kärnan använder det nyare diskgränssnittet "libata" behöver du det nyare DiskID eller UUID i din /etc/lilo.conf för uppstarts- och rot-flaggor. För de flesta moderna systemen ska denna konvertering göras och sedan ska "/sbin/lilo" köras.
